package biz.redlotus.hrms.enumeration;

public enum CertificateEnum {
	DOCTOR;
	/*
	 * private static final String[] COMPETENCE_ID = new String[] { "1", "2",
	 * "3",
	 * "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15",
	 * "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26",
	 * "999" };
	 * 
	 * private static final String[] COMPETENCE_NAME = new String[] { "医師",
	 * "歯科医師", "歯科衛生士", "獣医師", "看護師", "薬剤師", "社会福祉士", "介護福祉士", "社会保険労務士",
	 * "公認会計士", "税理士", "弁理士", "弁護士", "司法書士", "行政書士", "建築士", "不動産鑑定士",
	 * "宅地建物取引主任者", "土地家屋調査士", "理・美容師", "調理師", "栄養士", "旅行業務取扱管理者", "技術士",
	 * "気象予報士", "心理療法士", "その他",
	 * 
	 * };
	 */
}
