package biz.redlotus.hrms.enumeration;

public enum MekikiFieldEnum {
	RAKU;
	/*
	 * private static final String[] SSN_DOMAIN_ID = new String[] { "01000",
	 * "01001", "01002", "01003", "01004", "01005", "01006", "01007",
	 * "01008", "01009", "01010", "01011", "02000", "02001", "02002",
	 * "02003", "02004", "03000", "03001", "03002", "03003", "03004",
	 * "03005", "03006", "04000", "04001", "04002", "04003", "04004",
	 * "04005", "05000", "05001", "05002", "05003", "05004", "05005",
	 * "05006", "05007", "05008", "05009", "06000", "06001", "06002",
	 * "06003", "06004", "06005", "06006", "06007", "06008", "07000",
	 * "07001", "07002", "07003", "07004", "07005", "07006", "07007",
	 * "07008", "08000", "08001", "08002", "08003", "08004", "08005",
	 * "08006", "08007", "09000", "09001", "09002", "09003", "09004",
	 * "09005", "09006", "09007", "09008", "09009", "10000", "10001",
	 * "10002", "10003", "10004", "10005", "11000", "11001", "11002",
	 * "11003", "11004", "12000", "12001", "12002", "12003", "12004" };
	 * 
	 * private static final String[] SSN_DOMAIN_NAME = new String[] { "楽", "占い",
	 * "映画・ドラマ・舞台", "音楽", "ギャンブル", "芸能・ＴＶ", "ゲーム", "本・漫画・アニメ", "ダンス",
	 * "スポーツ", "旅行", "乗物", "食", "グルメ・レストラン", "料理・レシピ", "酒・飲物", "お菓子", "健",
	 * "癒し・ヒーリング", "医療・病院", "カウンセリング", "健康食品", "健康グッズ", "代替医療", "美",
	 * "ｱﾝﾁｴｲｼﾞﾝｸﾞ", "美容・エステ", "ファッション", "ダイエット", "コスメ・メイクアップ", "生",
	 * "家庭・家事", "結婚・恋愛", "子育て", "介護", "ｺﾐｭﾆｹｰｼｮﾝ・交流", "ガーデニング", "防犯・防災",
	 * "環境・エコロジー", "住居・インテリア", "学", "歴史", "文化", "語学・留学", "思想・哲学", "宗教",
	 * "検定・診断", "教育・学校", "精神世界", "業", "営業", "起業・独立開業", "経営", "農業",
	 * "ｺﾝｻﾙﾃｨﾝｸﾞ", "経理・財務", "キャリアアップ", "事務", "財", "金融", "不動産", "保険・年金",
	 * "投資・資産運用", "知的財産", "税金", "経済", "技", "技術", "芸術・工芸・アート", "建築・土木",
	 * "コンピュータ", "ｿﾌﾄｳｪｱ･ﾌﾟﾛｸﾞﾗﾐﾝｸﾞ", "インターネット", "ものづくり", "デザイン・設計", "写真",
	 * "然", "植物", "動物・鳥", "海洋生物", "その他生物", "鉱物", "政", "政治", "軍事", "法律",
	 * "国際社会", "侍", "武道", "日本精神", "伝統文化", "サムライ" };
	 */
}
