package biz.redlotus.hrms.enumeration;

public enum WorkCategoryEnum {
	OPERATION;
	/*
	 * private static final String[] JOB_ID = new String[] { "1", "2", "3", "4",
	 * "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16",
	 * "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27",
	 * "28", "29", "30", "999" };
	 * 
	 * private static final String[] JOB_NAME = new String[] { "営業系", "企画系",
	 * "事務系", "経理財務系", "法律系", "コンサルタント系", "金融系", "不動産系", "クリエイティブ系",
	 * "マネジメント系", "販売系", "主婦系", "レジャー系", "公的サービス系", "教育サービス系", "飲食サービス系",
	 * "健康サービス系", "カウンセリング系", "美容サービス系", "コーチ・トレーナー系", "医療サービス", "情報技術系",
	 * "電気技術系", "電子技術系", "機械技術系", "医療技術系 ", "科学技術系", "食品技術系", "建築土木技術系",
	 * "研究開発系", "その他" };
	 */
}
